# encoding: UTF-8
# Question#is_mandatory is now false by default. The default_mandatory option allows you to set
#   is_mandatory for all questions in a survey.

survey "REFINANCE" do

  section "1 : ข้อมูลหน่วยงาน" do
    group "รายละเอียด" do
      q_0101 "ชื่อองค์กร/หน่วยงาน/สถานประกอบการ"
      a :string

      q_0102 "ภาค", :pick => :one, :display_type => :dropdown
      a_1 "ภาคเหนือ"
      a_2 "ภาคตะวันออกเฉียงเหนือ"
      a_3 "ภาคกลาง"
      a_4 "ภาคตะวันออก"
      a_5 "ภาคตะวันตก"
      a_6 "ภาคใต้"

      q_0102a "จังหวัด", :pick => :one, :display_type => :dropdown
      dependency :rule => "A"
      condition_A :q_0102, "==", :a_1
      a "จังหวัดเชียงราย "
      a "จังหวัดเชียงใหม่ "
      a "จังหวัดน่าน "
      a "จังหวัดพะเยา "
      a "จังหวัดแพร่ "
      a "จังหวัดแม่ฮ่องสอน "
      a "จังหวัดลำปาง "
      a "จังหวัดลำพูน "
      a "จังหวัดอุตรดิตถ์ "

      q_0102b "จังหวัด", :pick => :one, :display_type => :dropdown
      dependency :rule => "A"
      condition_A :q_0102, "==", :a_2
      a "จังหวัดกาฬสินธุ์ "
      a "จังหวัดขอนแก่น "
      a "จังหวัดชัยภูมิ "
      a "จังหวัดนครพนม "
      a "จังหวัดนครราชสีมา "
      a "จังหวัดบึงกาฬ "
      a "จังหวัดบุรีรัมย์ "
      a "จังหวัดมหาสารคาม "
      a "จังหวัดมุกดาหาร "
      a "จังหวัดยโสธร "
      a "จังหวัดร้อยเอ็ด "
      a "จังหวัดเลย "
      a "จังหวัดสกลนคร "
      a "จังหวัดสุรินทร์ "
      a "จังหวัดศรีสะเกษ "
      a "จังหวัดหนองคาย "
      a "จังหวัดหนองบัวลำภู "
      a "จังหวัดอุดรธานี "
      a "จังหวัดอุบลราชธานี "
      a "จังหวัดอำนาจเจริญ "

      q_0102c "จังหวัด", :pick => :one, :display_type => :dropdown
      dependency :rule => "A"
      condition_A :q_0102, "==", :a_3
      a "กรุงเทพมหานคร"
      a "จังหวัดกำแพงเพชร "
      a "จังหวัดชัยนาท "
      a "จังหวัดนครนายก "
      a "จังหวัดนครปฐม "
      a "จังหวัดนครสวรรค์ "
      a "จังหวัดนนทบุรี "
      a "จังหวัดปทุมธานี "
      a "จังหวัดพระนครศรีอยุธยา "
      a "จังหวัดพิจิตร "
      a "จังหวัดพิษณุโลก "
      a "จังหวัดเพชรบูรณ์ "
      a "จังหวัดลพบุรี "
      a "จังหวัดสมุทรปราการ "
      a "จังหวัดสมุทรสงคราม "
      a "จังหวัดสมุทรสาคร "
      a "จังหวัดสิงห์บุรี "
      a "จังหวัดสุโขทัย "
      a "จังหวัดสุพรรณบุรี "
      a "จังหวัดสระบุรี "
      a "จังหวัดอ่างทอง "
      a "จังหวัดอุทัยธานี "

      q_0102d "จังหวัด", :pick => :one, :display_type => :dropdown
      dependency :rule => "A"
      condition_A :q_0102, "==", :a_4
      a "จังหวัดจันทบุรี "
      a "จังหวัดฉะเชิงเทรา "
      a "จังหวัดชลบุรี "
      a "จังหวัดตราด "
      a "จังหวัดปราจีนบุรี "
      a "จังหวัดระยอง "
      a "จังหวัดสระแก้ว "

      q_0102e "จังหวัด", :pick => :one, :display_type => :dropdown
      dependency :rule => "A"
      condition_A :q_0102, "==", :a_5
      a "จังหวัดกาญจนบุรี "
      a "จังหวัดตาก "
      a "จังหวัดประจวบคีรีขันธ์ "
      a "จังหวัดเพชรบุรี "
      a "จังหวัดราชบุรี "

      q_0102f "จังหวัด", :pick => :one, :display_type => :dropdown
      dependency :rule => "A"
      condition_A :q_0102, "==", :a_6
      a "จังหวัดกระบี่ "
      a "จังหวัดชุมพร "
      a "จังหวัดตรัง "
      a "จังหวัดนครศรีธรรมราช "
      a "จังหวัดนราธิวาส "
      a "จังหวัดปัตตานี "
      a "จังหวัดพังงา "
      a "จังหวัดพัทลุง "
      a "จังหวัดภูเก็ต "
      a "จังหวัดระนอง "
      a "จังหวัดสตูล "
      a "จังหวัดสงขลา "
      a "จังหวัดสุราษฎร์ธานี "
      a "จังหวัดยะลา "

      q_0103 "อำเภอ/เขต"
      a  :string

      q_0104 "ตำบล/แขวง"
      a :string

    end

  end

  section "2 : ข้อมูลทั่วไป" do
    q_0201 "เพศ",:pick => :one, :display_type => :inline
    a "ชาย"
    a "หญิง"
    a "เพศทางเลือก"

    q_0202 "อายุ"
    a "|ปี", :integer

    q_0203 "สถานภาพสมรส", :pick => :one, :display_type => :dropdown
    a_1 "โสด"
    a_2 "แต่งงานและอยู่ร่วมกัน"
    a_3 "แต่งงานแต่ไม่ได้อยู่ด้วยกัน"
    a_4 "อยู่ด้วยกันโดยไม่ได้แต่งงาน"
    a_5 "หม้าย"
    a_6 "หย่า/แยกทาง/เลิกกัน"

    q_0204 "ท่านมีบุตรหรือไม่ (รวมลูกบุญธรรม/ลูกติด/ลูกเลี้ยง)", :pick => :one, :display_type => :dropdown
    a_1 "ไม่มี"
    a_2 "มี จำนวน 1 คน"
    a_3 "มี จำนวน 2 คน"
    a_4 "มี จำนวน 3-4 คน"
    a_5 "มี จำนวนตั้งแต่ 5 คนขึ้นไป"
 
    q_0205 "ท่านปฏิบัติงานในระดับตำแหน่งใด", :pick => :one, :display_type => :dropdown
    a_1 "ระดับปฏิบัติงาน"
    a_2 "ระดับหัวหน้างาน"
    a_3 "ระดับผู้บริหารองค์กร"
    a_4 "อื่นๆ (ระบุ)"

    q_0205a "ระบุ"
    a :string
    dependency :rule => "A"
    condition_A :q_0205, "==", :a_4

    q_0206 "สถานภาพการจ้างงาน", :pick => :one, :display_type => :dropdown
    a_1 "ประจำ"
    a_2 "ตามสัญญาจ้าง"
    a_3 "รายวัน"
    a_4 "บางช่วงเวลา"
    a_5 "ตามผลงาน"
    a_6 "จ้างเหมา"

    q_0207 "ระยะเวลาที่ท่านทำงานในองค์กรปัจจุบัน รวมทั้งหมด", :pick => :one
    a_1 "ไม่ถึงปี"
    a_2 "ระหว่าง 1-2 ปี"
    a_3 "ระหว่าง 3-5 ปี"
    a_4 "ระหว่าง 6-9 ปี"

    q_0208 "ท่านมีรายได้ต่อเดือน โดยประมาณเดือนละเท่าใด (รายได้+เงินเดือน+ค่าตอบแทนอื่นๆ)", :pick => :one
    a_1 "น้อยกว่า 10,000 บาท"
    a_2 "10,001-20,000 บาท"
    a_3 "20,001-30,000 บาท"
    a_4 "30,001-40,000 บาท"
    a_5 "40,001-50,000 บาท"
    a_6 "50,001-100,000 บาท"
    a_7 "มากกว่า 100,000 บาท"

  end

  section "3 : Refinance Candidate" do

  label "Happy Money / สุขภาพเงินดี"

    q_0301 "ท่านรู้สึกว่า การผ่อนชำระหนี้สินต่างๆ โดยรวมของท่านในปัจจุบันเป็นภาระ หรือไม่", :pick => :one
    a_1 "เป็นภาระหนักที่สุด"
    a_2 "เป็นภาระหนักมาก"
    a_3 "เป็นภาระปานกลาง"
    a_4 "เป็นภาระน้อย"
    a_5 "ไม่เป็นภาระ/ไม่ได้ผ่อนชำระ/ไม่มีหนี้สิน"

    q_0302 "ท่านผ่อนชำระหนี้ตามกำหนดเวลาทุกครั้งหรือไม่", :pick => :one
    a_1 "ไม่ตรงเวลาทุกครั้ง"
    a_2 "ไม่ตรงเวลาบ่อยครั้ง"
    a_3 "ตรงเวลาบ้างบางครั้ง"
    a_4 "ตรงเวลาเกือบทุกครั้ง"
    a_5 "ตรงเวลาทุกครั้ง/ไม่ได้ผ่อนชำระ/ไม่มีหนี้สิน"

    q_0303 "โดยรวมแล้ว ท่านมีเงินเก็บออมในแต่ละเดือนหรือไม่", :pick => :one
    a_1 "ไม่มี/มีน้อยที่สุด"
    a_2 "มี/เก็บออมเพียงเล็กน้อย"
    a_3 "มี/เก็บออมปานกลาง"
    a_4 "มี/เก็บออมมาก"
    a_5 "มี/เก็บออมมากที่สุด"

    q_0304 "โดยรวมแล้ว ค่าตอบแทนที่ท่านได้รับทั้งหมดในแต่ละเดือนเป็นอย่างไร เมื่อเปรียบเทียบกับรายจ่ายทั้งหมดในแต่ละเดือน", :pick => :one
    a_1 "รายจ่ายเกินกว่ารายได้มาก"
    a_2 "รายจ่ายเกินกว่าเล็กน้อย"
    a_3 "รายจ่ายพอๆ"
    a_4 "รายจ่ายน้อยกว่ารายได้"
    a_5 "รายจ่ายน้อยกว่ารายได้มาก"

  end
end


