# encoding: UTF-8
# Question#is_mandatory is now false by default. The default_mandatory option allows you to set
#   is_mandatory for all questions in a survey.

survey "HAPPYMONEY" do
    
  section "1 : ข้อมูลทั่วไปเฉพาะส่วนบุคคล" do
    group "รายละเอียด" do
      q_0101 "ชื่อ"
      a :string

      q_0102 "นามสกุล"
      a :string

      q_0103 "อายุ"
      a :integer

      q_0104 "เพศ",:pick => :one, :display_type => :inline
      a "ชาย"
      a "หญิง"
    
      q_0105 "สถานภาพสมรส", :pick => :one, :display_type => :dropdown
 
      a "โสด"
      a "สมรสจดทะเบียน"
      a "สมรสไม่จดทะเบียน"
      a "หม้าย"
      a "หย่าร้าง"

      q_0106 "โปรดเลือกประเภทการจ้างงานของท่าน", :pick => :one, :display_type => :dropdown

      a "ข้าราชการ"
      a "พนักงานราชการ"
      a "พนักงานของรัฐ"
      a "ลูกจ้างประจำ"
      a "ลูกจ้างชั่วคราว"
      a "อื่นๆ"

      q_0107 "โปรดเลือกสายงานของท่าน", :pick => :one, :display_type => :dropdown

      a "เจ้าพนักงานการเกษตร"
      a "เจ้าพนักงานการเงินและบัญชี"
      a "เจ้าพนักงานการแพทย์แผนไทย"
      a "เจ้าพนักงานเครื่องคอมพิวเตอร์"
      a "เจ้าพนักงานทันตสาธารณสุข"
      a "เจ้าพนักงานธุรการ"
      a "เจ้าพนักงานเผยแพร่ประชาสัมพันธ์"
      a "เจ้าพนักงานพัสดุ"
      a "เจ้าพนักงานเภสัชกรรม"
      a "เจ้าพนักงานรังสีการแพทย์"
      a "เจ้าพนักงานวิทยาศาสตร์การแพทย์"
      a "เจ้าพนักงานเวชกรรมฟื้นฟู"
      a "เจ้าพนักงานเวชกิจฉุกเฉิน"
      a "เจ้าพนักงานเวชสถิติ"
      a "เจ้าพนักงานสถิติ"
      a "เจ้าพนักงานสาธารณสุข"
      a "เจ้าพนักงานโสตทัศนศึกษา"
      a "เจ้าพนักงานห้องสมุด"
      a "เจ้าพนักงานอาชีวบำบัด"
      a "เจ้าหน้าที่บันทึกข้อมูล"
      a "ช่างกายอุปกรณ์"
      a "ช่างเครื่องช่วยคนพิการ"
      a "ช่างซ่อมเครื่องทําความเย็น"
      a "ช่างซ่อมบำรุง"
      a "ช่างต่อท่อ"
      a "ช่างตัดเย็บผ้า"
      a "ช่างทันตกรรม"
      a "ช่างประปา"
      a "ช่างปูน"
      a "ช่างฝีมือทั่วไป"
      a "ช่างไฟฟ้า"
      a "ช่างไฟฟ้าและอิเลคทรอนิคส์"
      a "ช่างภาพการแพทย์"
      a "ช่างไม้"
      a "ช่างศิลป์"
      a "ช่างเหล็ก"
      a "ช่างอิเลคทรอนิคส์"
      a "ทันตแพทย์"
      a "นักกายภาพบำบัด"
      a "นักการแพทย์แผนไทย"
      a "นักกิจกรรมบำบัด"
      a "นักจัดการงานทั่วไป"
      a "นักจิตวิทยา"
      a "นักจิตวิทยาคลินิก"
      a "นักทรัพยากรบุคคล"
      a "นักเทคนิคการแพทย์"
      a "นักเทคโนโลยีสารสนเทศ"
      a "นักเทคโนโลยีหัวใจและทรวงอก"
      a "นักประชาสัมพันธ์"
      a "นักโภชนาการ"
      a "นักรังสีการแพทย์"
      a "นักวิเคราะห์นโยบายและแผน"
      a "นักวิชาการคอมพิวเตอร์"
      a "นักวิชาการเงินและบัญชี"
      a "นักวิชาการตรวจสอบภายใน"
      a "นักวิชาการเผยแพร่"
      a "นักวิชาการพัสดุ"
      a "นักวิชาการศึกษา"
      a "นักวิชาการศึกษาพิเศษ"
      a "นักวิชาการสถิติ"
      a "นักวิชาการสาธารณสุข"
      a "นักวิชาการโสตทัศนศึกษา"
      a "นักวิทยาศาสตร์"
      a "นักวิทยาศาสตร์การกีฬา"
      a "นักวิทยาศาสตร์การแพทย์"
      a "นักเวชศาสตร์การสื่อความหมาย"
      a "นักสังคมสงเคราะห์"
      a "นายช่างเทคนิค"
      a "นายช่างไฟฟ้า"
      a "นายช่างโยธา"
      a "นายช่างศิลป์"
      a "นายแพทย์"
      a "นิติกร"
      a "บรรณารักษ์"
      a "ผู้ช่วยเจ้าหน้าที่สาธารณสุข"
      a "ผู้ช่วยเจ้าหน้าที่อนามัย"
      a "ผู้ช่วยช่างทั่วไป"
      a "ผู้ช่วยช่างไม้"
      a "ผู้ช่วยทันตแพทย์"
      a "ผู้ช่วยนักกายภาพบำบัด"
      a "ผู้ช่วยพนักงานสุขศึกษา"
      a "ผู้ช่วยพยาบาล"
      a "ผู้ช่วยแพทย์แผนไทย"
      a "ผู้ช่วยเภสัชกร"
      a "ผู้ดูแลหมวดสถานที่"
      a "ผู้ประสานงานโครงการ"
      a "ผู้อำนวยการเฉพาะด้าน(แพทย์)"
      a "พนักงานกายภาพบำบัด"
      a "พนักงานการเงินและบัญชี"
      a "พนักงานการแพทย์และรังสีเทคนิค"
      a "พนักงานกู้ชีพ"
      a "พนักงานเก็บเงิน"
      a "พนักงานเก็บเอกสาร"
      a "พนักงานเกษตรพื้นฐาน"
      a "พนักงานขับรถยนต์"
      a "พนักงานจัดการหอพัก"
      a "พนักงานจัดทำข้อมูลประมวลผล"
      a "พนักงานจุลทัศนากร"
      a "พนักงานช่วยการพยาบาล"
      a "พนักงานช่วยเหลือคนไข้"
      a "พนักงานซักฟอก"
      a "พนักงานทั่วไป"
      a "พนักงานธุรการ"
      a "พนักงานบริการ"
      a "พนักงานบริการเอกสารทั่วไป"
      a "พนักงานบัตรรายงานโรค"
      a "พนักงานปฏิบัติการทดลองพาหะนำโรค"
      a "พนักงานประกอบอาหาร"
      a "พนักงานประจำตึก"
      a "พนักงานประจำห้องทดลอง"
      a "พนักงานประจำห้องยา"
      a "พนักงานประเมินผล"
      a "พนักงานเปล"
      a "พนักงานผลิตน้ำประปา"
      a "พนักงานผ่าและรักษาศพ"
      a "พนักงานพัสดุ"
      a "พนักงานพิมพ์"
      a "พนักงานแพทย์แผนไทย"
      a "พนักงานเภสัชกรรม"
      a "พนักงานเยี่ยมบ้าน"
      a "พนักงานรหัส"
      a "พนักงานระบาดวิทยา"
      a "พนักงานรักษาความปลอดภัย"
      a "พนักงานรับโทรศัพท์"
      a "พนักงานวิทยาศาสตร์"
      a "พนักงานวิทยุ"
      a "พนักงานสถานที่"
      a "พนักงานสถิติ"
      a "พนักงานสื่อสาร"
      a "พนักงานสุขภาพชุมชน"
      a "พนักงานโสตทัศนศึกษา"
      a "พนักงานห้องปฏิบัติการ"
      a "พนักงานห้องผ่าตัด"
      a "พนักงานห้องเฝือก"
      a "พนักงานห้องสมุด"
      a "พยาบาลเทคนิค"
      a "พยาบาลวิชาชีพ"
      a "พี่เลี้ยง"
      a "แพทย์แผนไทย"
      a "แพทย์แผนไทยประยุกต์"
      a "เภสัชกร"
      a "โภชนากร"
      a "แม่บ้าน"
      a "ล่ามภาษาต่างประเทศ"
      a "วิศวกร"
      a "วิศวกรไฟฟ้า"
      a "คนสวน"
      a_1 "อื่นๆ (ระบุ)"

      q_0107a "ระบุ"
      dependency :rule => "A"
      condition_A :q_0107, "==", :a_1

      a :string

    end

  end

  section "2 : ข้อมูลแสดงรายรับ-รายจ่าย" do
    label "2.1 ข้อมูลแสดงรายรับตาม สลิปเงินเดือน"
      group "รายละเอียด" do
        q_0211 "ท่านมีรายรับที่ได้รับจากกระทรวงสาธารณสุข โดยเฉลี่ย เดือนละ"
        a "|บาท", :integer

        q_0212 "เงินเดือน"
        a "|บาท", :integer
          
        q_0213 "เงินประจำตำแหน่ง"
        a "|บาท", :integer
          
        q_0214 "เงินพตส/เบี้ยเลี้ยงเหมาจ่าย"
        a "|บาท", :integer
          
        q_0215 "เงินค่าทำการนอกเวลา"
        a "|บาท", :integer
          
        q_0216 "เงินค่าเวร"
        a "|บาท", :integer          
          
        q_0217 "เงินเพิ่มพิเศษอื่น ๆ"
        a "|บาท", :integer          

        q_0218 "ท่านมีรายได้ที่ได้รับนอกจากกระทรวงสาธารณสุข โดยเฉลี่ย เดือนละ"
        a "|บาท", :integer          
          
      end
      
    label "2.2 ข้อมูลแสดงรายจ่ายประจำ ดังนี้"
      group "รายละเอียด" do
        q_0221 "ค่าผ่อนบ้านหรือคอนโดที่อยู่อาศัยโดยเฉลี่ย เดือนละ"
        a "|บาท", :integer          

        q_0222 "ค่าผ่อนชำระหนี้สินอื่น (ที่ไม่ใช่ที่อยู่อาศัย)โดยเฉลี่ย เดือนละ"
        a "|บาท", :integer          

        q_0223 "รายจ่ายอื่นๆ ได้แก่ ค่าเช่าบ้าน/ ค่าส่วนกลางคอนโดหรือหมู่บ้าน/ ค่าน้ำ ค่าไฟ โทรศัพท์ อินเตอร์เน็ต/ ค่าขยะ/ ค่าเล่าเรียน/ ค่าเลี้ยงดูบิดามารดาหรือบุตร/ ค่ารักษาพยาบาล/ ค่าใช้จ่ายส่วนตัว/ ค่าอาหาร/ ค่าเดินทาง/ ค่าภาษี/ ค่าภาษีสังคม ประมาณ  เดือนละ"
        a "|บาท", :integer

        q_0224 "รายจ่ายสำหรับการลงทุนธุรกิจ รวมถึงประกันชีวิต / ซื้อกองทุนต่างๆ ประมาณปีละ"
        a "|บาท (ต่อปี)", :integer
      end
  end
    
  section "3 : ข้อมูลภาระหนี้สินที่ต้องผ่อนชำระตั้งแต่ 12 เดือนขึ้นไป" do
    q_0301 "หนี้สินกู้บ้าน/คอนโด/ทาวน์เฮ้าส์/อาคารพาณิชย์/อสังหาริมทรัพย์  ยอดหนี้คงเหลือ ณ ปัจจุบัน"
    a "|บาท", :integer    

    q_0302 "หนี้สินจากสหกรณ์ออมทรัพย์  ยอดหนี้คงเหลือ ณ ปัจจุบัน"
    a "|บาท", :integer

    q_0303 "หนี้สินเพื่อซื้อรถยนต์หรือรถจักรยานยนต์  ยอดหนี้คงเหลือ ณ ปัจจุบัน"
    a "|บาท", :integer

    q_0304 "หนี้จากบัตรเครดิต  ยอดหนี้คงเหลือ ณ ปัจจุบัน"
    a "|บาท", :integer

    q_0305 "หนี้เพื่อการศึกษาของตนเองหรือบุคคลในครอบครัว  ยอดหนี้คงเหลือ ณ ปัจจุบัน"
    a "|บาท", :integer

    q_0306 "หนี้นอกระบบ (สินเชื่อส่วนบุคคลนอกระบบ)  ยอดหนี้คงเหลือ ณ ปัจจุบัน"
    a "|บาท", :integer

  end

  section "4 : ข้อมูลหนี้สินที่อยู่อาศัย" do
    q_0401 "4.1 ท่านได้กู้เงินเพื่อซื้อ/ สร้างบ้านพร้อมที่ดิน/คอนโดมิเนียม/อาคารพาณิชย์/ทาวน์เฮ้าส์หรือไม่", :pick => :one, :display_type => :inline
    a_1 "ไม่กู้"
    a_2 "กู้"
      
    q_0401a "ที่อยู่อาศัยแห่งที่ 1"
    dependency :rule => "A"
    condition_A :q_0401, "==", :a_2

    group "รายละเอียด" do
      q_0401a1 "ท่านกู้เงินเพื่อซื้อ/ สร้างบ้านพร้อมที่ดิน/คอนโดมิเนียม/อาคารพาณิชย์/ทาวน์เฮ้าส์ สถานะกู้ของท่านเป็นแบบใด", :pick => :one, :display_type => :dropdown
      a_1 "กู้เดี่ยว"  
      a_2 "กู้ร่วมโดยท่านเป็นผู้กู้หลัก"
      a_3 "กู้ร่วมโดยท่านเป็นผู้กู้ร่วม"

      q_0401a2 "สถาบันการเงิน"
      a :string

      q_0401a3 "วงเงินกู้เริ่มต้น"
      a "|บาท", :integer
        
      q_0401a4 "ยอดหนี้คงเหลือปัจจุบัน"
      a "|บาท", :integer
        
      q_0401a5 "ดอกเบี้ยกู้ปัจจุบัน"
      a "|บาท", :integer
        
      q_0401a6 "ผ่อนชำระขั้นต่ำต่อเดือน"
      a "|บาท", :integer

      q_0401a7 "ผ่อนชำระมาแล้ว"
      a "|ปี / เดือน", :string
    end
 
    q_0401b "ที่อยู่อาศัยแห่งที่ 2"
    dependency :rule => "A"
    condition_A :q_0401, "==", :a_2

    group "รายละเอียด" do
      q_0401b1 "ท่านกู้เงินเพื่อซื้อ/ สร้างบ้านพร้อมที่ดิน/คอนโดมิเนียม/อาคารพาณิชย์/ทาวน์เฮ้าส์ สถานะกู้ของท่านเป็นแบบใด", :pick => :one, :display_type => :dropdown
      a_1 "กู้เดี่ยว"  
      a_2 "กู้ร่วมโดยท่านเป็นผู้กู้หลัก"
      a_3 "กู้ร่วมโดยท่านเป็นผู้กู้ร่วม"

      q_0402b2 "สถาบันการเงิน"
      a :string

      q_0402b3 "วงเงินกู้เริ่มต้น"
      a "|บาท", :integer
        
      q_0402b4 "ยอดหนี้คงเหลือปัจจุบัน"
      a "|บาท", :integer
        
      q_0402b5 "ดอกเบี้ยกู้ปัจจุบัน"
      a "|บาท", :integer
        
      q_0402b6 "ผ่อนชำระขั้นต่ำต่อเดือน"
      a "|บาท", :integer

      q_0402b7 "ผ่อนชำระมาแล้ว"
      a "|ปี / เดือน", :string
    end    

    q_0401c "4.2 ในช่วง 24 เดือนที่ผ่านมา ท่านเคยผิดนัดชำระค่าผ่อนบ้าน หรือไม่", :pick => :one, :display_type => :dropdown
    dependency :rule => "A"
    condition_A :q_0401, "==", :a_2

    a "ไม่เคย"
    a "เคยผิดนัดชำระ แต่ไม่เกิน 90 วัน"
    a "เคยผิดนัดชำระเกิน 90 วัน"
  end
    
  section "5 : ความสนใจโครงการสินเชื่อที่อยุ่อาศัยและการรีไฟแนนซ์ (refinance)" do
      


  end    
end


